In [119]:
import pandas as pd
import os
import numpy as np

### DataFrame 생성

In [120]:
friend_dict_list = [
    {'name' : 'John', 'age' : 25, 'job' : 'student'},
    {'name' : 'Nate', 'age' : 30, 'job' : 'teacher'}
]

In [121]:
friend_dict_list

[{'name': 'John', 'age': 25, 'job': 'student'},
 {'name': 'Nate', 'age': 30, 'job': 'teacher'}]

In [122]:
df = pd.DataFrame(friend_dict_list)

In [123]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [124]:
df[['name', 'age']]

   name  age
0  John   25
1  Nate   30

In [125]:
from collections import OrderedDict # 동등할 때 엄격하게 구분해줌

In [126]:
friend_ordered_dict = OrderedDict(
    [
        ('name',['John', 'Nate']),
        ('age',['25', '30']),
        ('job',['student', 'teacher'])
    ])

In [127]:
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [128]:
df.head()

   name age      job
0  John  25  student
1  Nate  30  teacher

In [129]:
friend_list = [
    ['John', 20, 'student'],
    ['Nate', 30, 'teacher']
]

In [130]:
column_name = ['name', 'age', 'job']

In [131]:
df = pd.DataFrame.from_records(friend_list, columns = column_name)

In [132]:
friend_list = [
    ['name' , ['John', 'Nate']],
    ['age' , [20, 30]],
    ['job' , ['student', 'teacher']]
]

In [133]:
df = pd.DataFrame.from_dict(dict(friend_list))

In [134]:
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [135]:
friends = [
    ['name' , ['Jone', 'Jenny', 'Nate']],
    ['age' , [20, 30, 20]],
    ['job' , ['student', None, 'teacher']]
]

In [136]:
df = pd.DataFrame.from_dict(dict(friends))

In [137]:
df.head()

    name  age      job
0   Jone   20  student
1  Jenny   30     None
2   Nate   20  teacher

In [138]:
df.to_csv('friends.csv', index = True, header = True, na_rep = '-')

In [139]:
df

    name  age      job
0   Jone   20  student
1  Jenny   30     None
2   Nate   20  teacher

In [140]:
df[1:3]

    name  age      job
1  Jenny   30     None
2   Nate   20  teacher

In [141]:
# .loc 행 추출
df.loc[[0,2]]

   name  age      job
0  Jone   20  student
2  Nate   20  teacher

In [142]:
df[df.age > 25]

    name  age   job
1  Jenny   30  None

In [143]:
df.query('age<25') # 문자열로 입력하면 맞는 조건을 출력해줌.

   name  age      job
0  Jone   20  student
2  Nate   20  teacher

In [144]:
df[(df.age>30) | (df.name == 'Jenny')]

    name  age   job
1  Jenny   30  None

In [145]:
# filter Column
df.iloc[:,0:2]

    name  age
0   Jone   20
1  Jenny   30
2   Nate   20

In [146]:
df1 = df[['name', 'job']] # 2개이상은 [[]]

In [147]:
df1

    name      job
0   Jone  student
1  Jenny     None
2   Nate  teacher

In [148]:
df.filter(items = ['age', 'job'])

   age      job
0   20  student
1   30     None
2   20  teacher

In [149]:
df.filter(like = 'b', axis = 1) # like는 b로 끝나는 지

       job
0  student
1     None
2  teacher

In [150]:
df.filter(regex = 'a', axis = 1) # regex는 a가 포함되어 있는지

    name  age
0   Jone   20
1  Jenny   30
2   Nate   20

In [151]:
df.drop(['name'],axis=1)

   age      job
0   20  student
1   30     None
2   20  teacher

In [152]:
df

    name  age      job
0   Jone   20  student
1  Jenny   30     None
2   Nate   20  teacher

In [153]:
df.drop(df.index[[0,2]])

    name  age   job
1  Jenny   30  None

In [154]:
df[df.age>20]

    name  age   job
1  Jenny   30  None

In [155]:
df = df.drop('age', axis = 1)

In [156]:
df

    name      job
0   Jone  student
1  Jenny     None
2   Nate  teacher

In [157]:
df

    name      job
0   Jone  student
1  Jenny     None
2   Nate  teacher

In [159]:
df['salary'] = 0

In [160]:
df

    name      job  salary
0   Jone  student       0
1  Jenny     None       0
2   Nate  teacher       0

In [161]:
import numpy as np

In [166]:
df['salary'] = np.where(df['job'] != 'student', 'yes', 'no') # job이 student가 아니면 yes, student면 no.

In [167]:
df

    name      job salary
0   Jone  student     no
1  Jenny     None    yes
2   Nate  teacher    yes